# Querying Data using Clauses

   In this section, we'll explore how to write advanced `SELECT` queries with various clauses. We'll use the previous `students_database.db` database and modify the `students` table to add additional fields like `GPA`, `Email ID`, and `Phone Number`.

**1. Import sqlite3 and os**

In [9]:
import sqlite3

In [11]:
import os

**2. List of Databases**

In [13]:
# List all .db files in the current directory
databases = [f for f in os.listdir() if f.endswith('.db')]
print("Databases:", databases)

Databases: ['sample_database.db', 'school.db', 'student_database.db']

**3. Reconnect to the `students_database.db` and Modify the Table**

In [5]:
# Connect to the student_database.db
db_connection = sqlite3.connect('student_database.db')
cursor = db_connection.cursor()
print("Reconnected to the database.")

Reconnected to the database.

**4. Fetch and display previous data from `students` table**

In [17]:
# Fetch and display previous data from 'students' table
cursor.execute("SELECT * FROM students;")
students_data = cursor.fetchall()
print("Students Data:", students_data)

Students Data: [(1, 'Anushka', 23), (2, 'Santosh', 20), (3, 'Nidhi', 21), (4, 'Vanama', 22), (5, 'Vinod', 24)]

**5. Alter Students table and add new columns.**

In [19]:
# Add new columns to the students table (if they don't exist)
cursor.execute("ALTER TABLE students ADD COLUMN major TEXT;")
cursor.execute("ALTER TABLE students ADD COLUMN gpa REAL;")
cursor.execute("ALTER TABLE students ADD COLUMN email TEXT;")
cursor.execute("ALTER TABLE students ADD COLUMN phone TEXT;")

print("Columns added successfully!")

Columns added successfully!

**6. Update Existing Records with Additional Data**

In [23]:
# Update existing student records with new data
update_queries = [
    ("UPDATE students SET major = ?, gpa = ?, email = ?, phone = ? WHERE id = ?",
     ('Computer Science', 3.8, 'anushka@example.com', '1234567890', 1)),
    ("UPDATE students SET major = ?, gpa = ?, email = ?, phone = ? WHERE id = ?",
     ('Mathematics', 3.5, 'santosh@example.com', '0987654321', 2)),
    ("UPDATE students SET major = ?, gpa = ?, email = ?, phone = ? WHERE id = ?",
     ('Physics', 3.9, 'nidhi@example.com', '1122334455', 3)),
    ("UPDATE students SET major = ?, gpa = ?, email = ?, phone = ? WHERE id = ?",
     ('Mathematics', 2.9, 'vanama@example.com', '6677889900', 4)),
    ("UPDATE students SET major = ?, gpa = ?, email = ?, phone = ? WHERE id = ?",
     ('Computer Science', 3.2, 'vinod@example.com', '7788991122', 5))

Existing student records updated!

**7. Executing Query**

In [ ]:
# Execute each update query
for query, params in update_queries:
    cursor.execute(query, params)

**8. Commiting changes**

In [ ]:
# Commit the changes
db_connection.commit()
print("Existing student records updated!")

**9. Insert New Students with All Columns Filled**

In [25]:
# Insert new student records
new_students = [
    (6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
    (7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899')
]

cursor.executemany(
    "INSERT INTO students (id, name, age, major, gpa, email, phone) VALUES (?, ?, ?, ?, ?, ?, ?);",
    new_students
)

New student records inserted!

**10. Commit Changes**

In [ ]:
# Commit the changes
db_connection.commit()
print("New student records inserted!")

**11. Fetch and Display the Updated Data**

   - Here we used **`fetchall()`** to retreive all the data from the table.

In [27]:
# Fetch and display all records from the students table
cursor.execute("SELECT * FROM students;")
students_data = cursor.fetchall()

print("Updated Students Data:")
for student in students_data:
    print(student)

Updated Students Data:
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890')
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321')
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455')
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900')
(5, 'Vinod', 24, 'Computer Science', 3.2, 'vinod@example.com', '7788991122')
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211')
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899')

  - Here we used **`fetchone()`** to retreive only one row from the data from the table.

In [29]:
# Fetch and display only one record from the students table
cursor.execute("SELECT * FROM students;")
students_data = cursor.fetchone()

print("Updated Students Data:")
for student in students_data:
    print(student)

Updated Students Data:
1
Anushka
23
Computer Science
3.8
anushka@example.com
1234567890

- Here the **`fetchone()`** is used to retrieve the specific id.

In [31]:
# Fetch and display only the record with id = 4
cursor.execute("SELECT * FROM students WHERE id = 4;")
student_data = cursor.fetchone()

print("Student Data for ID 4:")
print(student_data)

Student Data for ID 4:
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900')

## Clauses

### SELECT `All` Records

In [11]:
# Fetch and display all records from the students table
cursor.execute("SELECT * FROM students;")
students_data = cursor.fetchall()

print("All Students Data:")
for student in students_data:
    print(student, end=',\n')

All Students Data:
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321'),
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900'),
(5, 'Vinod', 24, 'Computer Science', 3.2, 'vinod@example.com', '7788991122'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),

### Condition-Based Queries

   - Definition: These queries retrieve data by applying certain conditions, typically with `WHERE`, `AND`, `OR`, `IN`, `BETWEEN`, or `LIKE` clauses.
   - Usage: Condition-based queries are essential when you want to filter records based on specific criteria.

**1. The `WHERE` Clause**

    The WHERE clause allows filtering records based on conditions.

In [42]:
print("\nStudents with GPA > 3.5:")
cursor.execute("SELECT * FROM students WHERE gpa > 3.5;")
gpa_data = cursor.fetchall()
for student in gpa_data:
    print(student, end=',\n')

Students with GPA > 3.5:
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),

**2. The `IN` Clause**
   
    The IN clause allows matching against multiple values.

In [18]:
# IN clause: Fetch students majoring in Mathematics or Physics
print("\nStudents Majoring in Mathematics or Physics:")
cursor.execute("SELECT * FROM students WHERE major IN ('Mathematics', 'Physics');")
in_data = cursor.fetchall()
for student in in_data:
    print(student, end=',\n')

Students Majoring in Mathematics or Physics:
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321'),
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900'),

**3. The `BETWEEN` Clause**

    The BETWEEN clause filters results within a specific range.

In [20]:
# BETWEEN clause: Fetch students with GPA between 3.5 and 4.0
print("\nStudents with GPA Between 3.5 and 4.0:")
cursor.execute("SELECT * FROM students WHERE gpa BETWEEN 3.5 AND 4.0;")
between_data = cursor.fetchall()
for student in between_data:
    print(student, end=',\n')

Students with GPA Between 3.5 and 4.0:
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321'),
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),

**4. The `LIKE` Clause for Pattern Matching**

    The LIKE clause is used for pattern matching in strings.

In [22]:
# LIKE clause: Search for students with '@example.com' in their email
print("\nStudents with '@example.com' Email:")
cursor.execute("SELECT * FROM students WHERE email LIKE '%@example.com';")
like_data = cursor.fetchall()
for student in like_data:
    print(student, end=',\n')

Students with '@example.com' Email:
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321'),
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900'),
(5, 'Vinod', 24, 'Computer Science', 3.2, 'vinod@example.com', '7788991122'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),

### Ordering

   - Helps sort the results in ascending (ASC) or descending (DESC) order using the ORDER BY clause.

**1. The `ORDER BY` Clause**

In [37]:
# ORDER BY clause: Sort students by GPA in descending order
print("\nStudents sorted by GPA (DESC):")
cursor.execute("SELECT * FROM students ORDER BY gpa DESC;")
sorted_data = cursor.fetchall()
for student in sorted_data:
    print(student, end=',\n')

Students sorted by GPA (DESC):
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),
(2, 'Santosh', 20, 'Mathematics', 3.5, 'santosh@example.com', '0987654321'),
(5, 'Vinod', 24, 'Computer Science', 3.2, 'vinod@example.com', '7788991122'),
(4, 'Vanama', 22, 'Mathematics', 2.9, 'vanama@example.com', '6677889900'),

### Pagination
   - Limits the number of records returned at a time using the `LIMIT` clause, often combined with `OFFSET` for loading subsequent pages.

**1. The `LIMIT` Clause**
   
   - The LIMIT clause restricts the number of rows returned by a query.

In [44]:
# LIMIT clause: Fetch only the top 2 students
print("\nTop 2 Students:")
cursor.execute("SELECT * FROM students ORDER BY gpa DESC LIMIT 2;")
top_students = cursor.fetchall()
for student in top_students:
    print(student, end=',\n')

Top 2 Students:
(3, 'Nidhi', 21, 'Physics', 3.9, 'nidhi@example.com', '1122334455'),
(1, 'Anushka', 23, 'Computer Science', 3.8, 'anushka@example.com', '1234567890'),

**2. The `offset` clause** 

   - It skips first 2 rows and returns the next 2 students by highest GPA.

In [32]:
# Page 2 (Next 2 students by GPA)
query = """
SELECT * FROM students 
ORDER BY gpa DESC 
LIMIT 2 OFFSET 2;
"""
cursor.execute(query)
page2_data = cursor.fetchall()

print("\nPage 2 (Next 2 Students by GPA):")
for student in page2_data:
    print(student, end=',\n')

Page 2 (Next 2 Students by GPA):
(7, 'Ravi', 23, 'Engineering', 3.7, 'ravi@example.com', '6655778899'),
(6, 'Meera', 22, 'Biology', 3.6, 'meera@example.com', '5544332211'),

**8. Close the connection**

In [63]:
# Close the database connection
db_connection.close()
print("Database connection closed.")

Database connection closed.

# Q&A

1. What is the basic syntax for a SELECT statement in SQL?

2. Can you retrieve unique values from a column using a SELECT query? If so, how?

3. How can you limit the number of records returned by a SELECT query?

4. How do you use the LIMIT and OFFSET clauses in an SQL query together?